PH_data/alpha_0.4/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/







FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
8940
(
( 1.468720075e-05 6.526574452e-06 4.867782195e-07 2.16130702e-05 3.520526377e-07 6.656277401e-05 )
( 1.799389247e-05 3.739530939e-06 5.279538868e-07 2.055829464e-05 3.180106205e-07 6.556425069e-05 )
( 1.404858722e-05 7.324384569e-06 4.399080069e-07 2.179782132e-05 3.426850128e-07 6.512819527e-05 )
( 1.811170841e-05 3.647776111e-06 5.283193332e-07 2.052728632e-05 3.159084372e-07 6.547084195e-05 )
( 1.623837306e-05 5.231077466e-06 5.030034913e-07 2.092705836e-05 3.445234711e-07 6.541651237e-05 )
( 1.330467148e-05 8.205662198e-06 3.770203421e-07 2.209633567e-05 3.230618688e-07 6.369672337e-05 )
( 1.269428867e-05 8.704908396e-06 3.916844946e-07 2.254160427e-05 3.122914904e-07 6.489641237e-05 )
( 1.763247565e-05 4.097814781e-06 5.072765816e-07 2.038847015e-05 3.404329334e-07 6.4220083e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
